const characters = [
    ["忌炎", "忌炎.webp", 5, "気動", "長刃", "蒼鱗連峰"],
    ["吟霖", "吟霖.webp", 5, "電導", "増幅器", "糸繰りの奇術"],
    ["今汐", "今汐.webp", 5, "回折", "長刃", "歳華調和"],
    ["長離", "長離.webp", 5, "焦熱", "迅刀", "赫く燃ゆる流光"],
    ["折枝", "折枝.webp", 5, "凝縮", "増幅器", "氷華の雅印"],
    ["相里要", "相里要.webp", 5, "電導", "手甲", "	万端の枢機"],
    ["ショアキーパー", "ショアキーパー.webp", 5, "回折", "増幅器", "星々のコンチェルト"],
    ["ツバキ", "ツバキ.webp", 5, "消滅", "迅刀", "春裁ち"],
    ["カルロッタ", "カルロッタ.webp", 5, "凝縮", "拳銃", "ラストダンス"],
    ["ロココ", "ロココ.webp", 5, "消滅", "手甲", "トラジコメーディア"],
    ["フィービー", "フィービー.webp", 5, "回折", "増幅器", "光のハルモニア"],
    ["ブラント", "ブラント.webp", 5, "焦熱", "迅刀", "エンドレスボヤージュ"],
    ["カンタレラ", "カンタレラ.png", 5, "消滅", "増幅器", "深海の囁き"],
    ["ザンニー", "ザンニー.webp", 5, "回折", "手甲", "焔光の裁き"],
    ["シャコンヌ", "シャコンヌ.webp", 5, "気動", "拳銃", "森のアリア"],
    ["カルテジア", "カルテジア.webp", 5, "気動", "迅刀", "定めを覆す荊冠"],
    ["ルパ", "ルパ.webp", 5, "焦熱", "長刃", "闘炎の爪痕"],
    ["フローヴァ", "フローヴァ.png", 5, "消滅", "増幅器", "幽冥の忘憂曲"],
    ["オーガスタ", "オーガスタ.webp", 5, "電導", "長刃", "雷霆を統べし王剣"],
    ["ユーノ", "ユーノ.webp", 5, "気動", "手甲", "	万物を書き留める月相"],
    ["ガルブレーナ", "ガルブレーナ.webp", 5, "焦熱", "拳銃", "ルクス＆アンブラ"],
    ["仇遠", "仇遠.webp", 5, "気動", "迅刀", "破敵の鋭竹"],
    ["千咲", "千咲.webp", 5, "消滅", "長刃", "曇斬"],
    ["リンネー", "リンネー.webp", 5, "回折", "拳銃", "スペクトル・ブラスター"],
    ["モーニエ", "モーニエ.webp", 5, "焦熱", "長刃", "スターキャリブレーター"],
    ["エイメス", "エイメス.webp", 5, "焦熱", "迅刀", "とこしえの明星"],
    ["リューク・ヘルセン", "リューク・ヘルセン.webp", 5, "回折", "手甲", "デイブレイカースパイン"],
    ["シグリカ", "シグリカ.webp", 5, "気動", "手甲", "	ソル・スウォーンの注釈"],
    ["緋雪", "緋雪.png", 5, "凝縮", "迅刀", "灼霜"],
    ["ダーニャ", "ダーニャ.webp", 5, "焦熱", "増幅器", "偽物の矮星"],
    ["レベッカ", "レベッカ.png", 5, "電導", "拳銃", "スカル・ポッパー"],
    ["ルーシー", "ルーシー.png", 5, "回折", "拳銃", "スペクトラル・トリガー"],
    ["ルシラー", "ルシラー.jpeg", 5, "凝縮", "増幅器", "フリーズフレーム"],
    ["秧秧・玄翎", "秧秧・玄翎.png", 5, "消滅", "迅刀", "天つ蒼淵"],
    ["穂穂", "穂穂.webp", 5, "凝縮", "増幅器", "夕霞の飲露"],
    ["清宵", "清宵.webp", 5, "気動", "迅刀", "雲琅"],
    ["景燃", "景燃.webp", 5, "焦熱", "長刃", ""],
    ["鎖瞑", "鎖瞑.webp", 5, "電導", "不明", "不明"],
    ["心", "心.jpg", 5, "電導", "不明", "不明"],
    
    ["淵武", "淵武.webp", 4, "電導", "手甲", "無し"],
    ["散華", "散華.webp", 4, "凝縮", "迅刀", "無し"],
    ["白芷", "白芷.webp", 4, "凝縮", "増幅器", "無し"],
    ["釉瑚", "釉瑚.webp", 4, "凝縮", "手甲", "無し"],
    ["熾霞", "熾霞.webp", 4, "焦熱", "拳銃", "無し"],
    ["モルトフィー", "モルトフィー.webp", 4, "焦熱", "拳銃", "無し"],
    ["灯灯", "灯灯.webp", 4, "電導", "長刃", "無し"],
    ["アールト", "アールト.png", 4, "気動", "拳銃", "無し"],
    ["卜霊", "卜霊.webp", 4, "電導", "増幅器", "無し"],
    ["秧秧", "秧秧.webp", 4, "気動", "迅刀", "無し"],
    ["桃祈", "桃祈.webp", 4, "消滅", "長刃", "無し"],
    ["丹瑾", "丹瑾.webp", 4, "消滅", "迅刀", "無し"]
];

// HTMLのgalleryを取得
const gallery = document.getElementById("gallery");


// ★5と★4に分ける
const fiveStar = characters.filter(character => character[2] === 5);
const fourStar = characters.filter(character => character[2] === 4);


// キャラクターを表示する関数
function displayCharacters(title, characters) {

    // 見出し
    gallery.innerHTML += `
        <h2 class="section-title">${title}</h2>
    `;

    // キャラクター表示
    characters.forEach(character => {

        const name = character[0];
        const image = character[1];
        const rarity = character[2];
        const attribute = character[3];
        const weapon = character[4];
        const mochiWeapon = character[5];

        gallery.innerHTML += `
            <div class="card" onclick="showDetail(this)">
                
                <img src="${image}" alt="${name}">
                
                <div class="name">${name}</div>

                <div class="detail-tab">
                    <h3>${name}</h3>
                    <p>レア度：${"★".repeat(rarity)}</p>
                    <p>属性：${attribute}</p>
                    <p>武器：${weapon}</p>
                    <p>餅武器：${mochiWeapon}</p>
                </div>

            </div>
        `;
    });
}


// 詳細タブを表示・非表示
function showDetail(card) {

    const detail = card.querySelector(".detail-tab");

    detail.classList.toggle("show");

}


// ★5 → ★4の順番で表示
displayCharacters("★5 キャラクター", fiveStar);
displayCharacters("★4 キャラクター", fourStar);
